import numpy as np

a = np.arange(12)

print(a)
print("1. a[2:7] = ",a[2:7])        #เลือกสมาชิกตั้งแต่ตำแหน่งที่ 2 ถึง 6
print("2. a[:7] = ",a[:7])          #เลือกสมาชิกตั้งแต่ตำแหน่งแรก ไม่เกินตำแหน่งที่ 7
print("3. a[2:] = ",a[2:])          #เลือกสมาชิกตั้งแต่ตำแหน่งที่ 2
print("4. a[2:7:3] = ",a[2:7:3])    #เลือกสมาชิกตั้งแต่ตำแหน่งที่ 2 ถึง 6 และห่างกันทีละ 3 ตำแหน่ง
print("5. a[::4] = ",a[::4])        #เลือกจากสมาชิกทั้งหมดเริ่มที่ตำแหน่ง 0 และห่างกันทีละ 4 ตำแหน่ง
print("6. a[:-1:2] = ",a[:-1:2])    #เลือกสมาชิกตั้งแต่ตำแหน่งที่ 3 จากท้าย และห่างกันทีละ 2 ตำแหน่ง
print("7. a[2::3] = ",a[2::3])      #เลือกสมาชิกตั้งแต่ตำแหน่งที่ 2 และห่างกันทีละ 3 ตำแหน่ง