def promotion() :
  print("โปรโมชั่นประจำเดือนนี้ ซื้อกาแฟ 1 แก้ว ฟรี 1 แก้ว")
  print("โปรโมชั่นสำหรับลูกค้าสมาชิก ลด 30% ทุกรายการ")
  print("โปรโมชั่นสำหรับลูกค้าใหม่ที่สมัครสมาชิกวันนี้ รับส่วนลดไปเลย 20%")

def coupon() :
  print("คูปอง : ซื้อครบทุก 200 บาท แลกรับส่วนลดท้ายใบเสร็จ 10 บาท")
  print("คูปอง : ลูกค้าออนไลน์ที่ช้อปเกิน 500 บาท จะได้รับคูปอง ฟรีค่าจัดส่ง")

print("คุณต้องการตรวจสอบข้อมูลใด")
print("1. โปรโมชั่น")
print("2. คูปอง")

choice = input("กรุณากรอก 1 หรือ 2 เพื่อตรวจสอบข้อมูล : ")

if int(choice) == 1 :
  promotion()
elif int(choice) == 2 :
  coupon()
else:
  print("คุณป้อนข้อมูลไม่ถูกต้อง")